Revit 2026 API

# ComponentRepeaterFailures Properties

---

The BuiltInFailuresComponentRepeaterFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ComponentRepeater_InvalidFamilyOnReload | Reloaded family not appropriate for repeater. |
|  | ComponentRepeater_ThereIsOnlyOneInstanceInThisRepeater | There is only one component in this repeater. |

#### Reference

BuiltInFailuresComponentRepeaterFailures Class

Autodesk.Revit.DB Namespace